lib/soap_actions/GetAllPayerPaymentMethods.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://propay.com/SPS/contracts" xmlns:typ="http://propay.com/SPS/types">
  <soapenv:Header/>
  <soapenv:Body>
    <con:GetAllPayerPaymentMethods>
      <con:billerIdentification>
        <%= @partial %>
      </con:billerIdentification>
      <con:payerAccountId><%= @options[:payer_id] %></con:payerAccountId>
    </con:GetAllPayerPaymentMethods>
  </soapenv:Body>
</soapenv:Envelope>
